src/cf/InformationRegisters/МашиночитаемыеДоверенностиСтатусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>МашиночитаемыеДоверенностиСтатусы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТехническийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТехническиеСтатусыМЧД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторТранзакции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусТранзакции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыТранзакцииСРеестромМЧД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТранзакции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТранзакцийСРеестромМЧД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаТранзакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапросаСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатЗапросаСтатуса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеОшибкиЗапросаСтатуса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подписана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МашиночитаемаяДоверенность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.МашиночитаемаяДоверенность</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыТранзакцииСРеестромМЧД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтатусыТранзакцииСРеестромМЧД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Успешно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТехническиеСтатусыМЧД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТехническиеСтатусыМЧД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Активна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Просрочено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарегистрировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияОтмены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаРегистрации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаНачалаДействияНеНаступила</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыТранзакцийСРеестромМЧД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыТранзакцийСРеестромМЧД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Регистрация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/МашиночитаемыеДоверенностиСтатусы/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ОбновлениеСтатусовМЧД(Доверенности = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	МашиночитаемыеДоверенности.Ссылка КАК МашиночитаемаяДоверенность,
	                |	МашиночитаемыеДоверенности.НомерДоверенности КАК НомерДоверенности,
	                |	МашиночитаемыеДоверенностиСтатусы.ИдентификаторТранзакции КАК ИдентификаторТранзакции,
	                |	МашиночитаемыеДоверенностиСтатусы.СтатусТранзакции КАК СтатусТранзакции,
	                |	МашиночитаемыеДоверенностиСтатусы.ТехническийСтатус КАК ТехническийСтатусТекущий,
	                |	МашиночитаемыеДоверенностиСтатусы.ТехническийСтатус КАК ТехническийСтатус,
	                |	МашиночитаемыеДоверенностиСтатусы.ТипТранзакции КАК ТипТранзакции,
	                |	МашиночитаемыеДоверенностиСтатусы.ДатаТранзакции КАК ДатаТранзакции,
	                |	МашиночитаемыеДоверенностиСтатусы.Подписана КАК Подписана,
	                |	ВЫБОР
	                |		КОГДА ЕСТЬNULL(МашиночитаемыеДоверенностиСтатусы.ИдентификаторТранзакции, """") = """"
	                |			ТОГДА ЛОЖЬ
	                |		КОГДА МашиночитаемыеДоверенностиСтатусы.СтатусТранзакции = ЗНАЧЕНИЕ(Перечисление.СтатусыТранзакцииСРеестромМЧД.ОжидаетОбработки)
	                |				ИЛИ МашиночитаемыеДоверенностиСтатусы.СтатусТранзакции = ЗНАЧЕНИЕ(Перечисление.СтатусыТранзакцииСРеестромМЧД.ПустаяСсылка)
	                |				ИЛИ &ПроверятьФинальныеСтатусы = ИСТИНА
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК ЗапросСтатусаТранзакции,
	                |	ВЫБОР
	                |		КОГДА МашиночитаемыеДоверенностиСтатусы.ТехническийСтатус = ЗНАЧЕНИЕ(Перечисление.ТехническиеСтатусыМЧД.Регистрация)
	                |				ИЛИ МашиночитаемыеДоверенностиСтатусы.ТехническийСтатус = ЗНАЧЕНИЕ(Перечисление.ТехническиеСтатусыМЧД.ДатаНачалаДействияНеНаступила)
	                |				ИЛИ МашиночитаемыеДоверенностиСтатусы.ТехническийСтатус = ЗНАЧЕНИЕ(Перечисление.ТехническиеСтатусыМЧД.Зарегистрировано)
	                |				ИЛИ МашиночитаемыеДоверенностиСтатусы.ТехническийСтатус = ЗНАЧЕНИЕ(Перечисление.ТехническиеСтатусыМЧД.РегистрацияОтмены)
	                |				ИЛИ &ПроверятьФинальныеСтатусы = ИСТИНА
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК ЗапросСтатусаДоверенности,
	                |	МашиночитаемыеДоверенности.Статус КАК Статус,
	                |	МашиночитаемыеДоверенности.ДляНалоговыхОрганов КАК ДляНалоговыхОрганов,
	                |	ВЫБОР
	                |		КОГДА МашиночитаемыеДоверенностиСтатусы.ТехническийСтатус = ЗНАЧЕНИЕ(Перечисление.ТехническиеСтатусыМЧД.Регистрация)
	                |				И МашиночитаемыеДоверенностиСтатусы.СтатусТранзакции <> ЗНАЧЕНИЕ(Перечисление.СтатусыТранзакцииСРеестромМЧД.Успешно)
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК Зарегистрировать,
	                |	МашиночитаемыеДоверенности.ФайлДоверенности КАК ФайлДоверенности,
	                |	МашиночитаемыеДоверенностиСтатусы.ДанныеОшибкиЗапросаСтатуса КАК ДанныеОшибкиЗапросаСтатусаТекущие
	                |ИЗ
	                |	Справочник.МашиночитаемыеДоверенности КАК МашиночитаемыеДоверенности
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МашиночитаемыеДоверенностиСтатусы КАК МашиночитаемыеДоверенностиСтатусы
	                |		ПО (МашиночитаемыеДоверенностиСтатусы.МашиночитаемаяДоверенность = МашиночитаемыеДоверенности.Ссылка)
	                |ГДЕ
	                |	(МашиночитаемыеДоверенностиСтатусы.СтатусТранзакции = ЗНАЧЕНИЕ(Перечисление.СтатусыТранзакцииСРеестромМЧД.ОжидаетОбработки)
	                |			ИЛИ МашиночитаемыеДоверенностиСтатусы.СтатусТранзакции = ЗНАЧЕНИЕ(Перечисление.СтатусыТранзакцииСРеестромМЧД.ПустаяСсылка)
	                |			ИЛИ МашиночитаемыеДоверенностиСтатусы.ТехническийСтатус = ЗНАЧЕНИЕ(Перечисление.ТехническиеСтатусыМЧД.Регистрация)
	                |			ИЛИ МашиночитаемыеДоверенностиСтатусы.ТехническийСтатус = ЗНАЧЕНИЕ(Перечисление.ТехническиеСтатусыМЧД.ДатаНачалаДействияНеНаступила)
	                |			ИЛИ МашиночитаемыеДоверенностиСтатусы.ТехническийСтатус = ЗНАЧЕНИЕ(Перечисление.ТехническиеСтатусыМЧД.Зарегистрировано)
	                |			ИЛИ МашиночитаемыеДоверенностиСтатусы.ТехническийСтатус = ЗНАЧЕНИЕ(Перечисление.ТехническиеСтатусыМЧД.РегистрацияОтмены)
	                |			ИЛИ &ПроверятьФинальныеСтатусы = ИСТИНА)
	                |	И МашиночитаемыеДоверенности.Ссылка В(&Доверенности)";
	Запрос.УстановитьПараметр("ПроверятьФинальныеСтатусы", Доверенности<>Неопределено);
	Если Доверенности = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "МашиночитаемыеДоверенности.Ссылка В(&Доверенности)", "Истина");
	Иначе
		Запрос.УстановитьПараметр("Доверенности", Доверенности);
	КонецЕсли;
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		ДоверенностиДляПроверкиСтатуса = Результат.Выгрузить();
		
		ДоверенностиДляПроверкиСтатуса.Колонки.Добавить("РезультатЗапросаСтатуса");
		ДоверенностиДляПроверкиСтатуса.Колонки.Добавить("ДатаЗапросаСтатуса");
		ДоверенностиДляПроверкиСтатуса.Колонки.Добавить("ЗаписыватьВРегистр");
		ДоверенностиДляПроверкиСтатуса.Колонки.Добавить("ЗаписыватьВДокумент");
		ДоверенностиДляПроверкиСтатуса.Колонки.Добавить("ДанныеОшибкиЗапросаСтатуса");
		
		Авторизация = МашиночитаемыеДоверенностиФНССлужебный.АвторизоватьсяНаСервереМЧДРР();
		Если Авторизация.Ошибка <> Неопределено Тогда
			Для Каждого ДоверенностьДляПроверки Из ДоверенностиДляПроверкиСтатуса Цикл
				ДоверенностьДляПроверки.ДатаЗапросаСтатуса = ТекущаяДатаСеанса();
				ДоверенностьДляПроверки.ДанныеОшибкиЗапросаСтатуса = Авторизация.Ошибка;
				ДоверенностьДляПроверки.РезультатЗапросаСтатуса = Авторизация.Ошибка.ЗаголовокОшибки;
			КонецЦикла;
			ЗаписатьРезультатОбновленияСтатуса(ДоверенностиДляПроверкиСтатуса);
			Возврат;
		КонецЕсли;
		
		ТокенДоступа = Авторизация.ТокенДоступа;
		
		Для Каждого ДоверенностьДляПроверки Из ДоверенностиДляПроверкиСтатуса Цикл
			
			ДоверенностьДляПроверки.ДанныеОшибкиЗапросаСтатуса = ДоверенностьДляПроверки.ДанныеОшибкиЗапросаСтатусаТекущие.Получить();
			
			ДоверенностьДляПроверки.ЗаписыватьВРегистр = Ложь;
			ДоверенностьДляПроверки.ЗаписыватьВДокумент = Ложь;
			
			Если ДоверенностьДляПроверки.Зарегистрировать Тогда
				ДоверенностьДляПроверки.ЗапросСтатусаТранзакции = Ложь;
				УстановленныеПодписи = ЭлектроннаяПодпись.УстановленныеПодписи(ДоверенностьДляПроверки.ФайлДоверенности);
	
				СвойстваФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаИДвоичныеДанные(
						ДоверенностьДляПроверки.ФайлДоверенности,, Новый УникальныйИдентификатор);
				
				Если УстановленныеПодписи.Количество() = 0 Тогда
					Возврат;
				КонецЕсли;
				
				ДанныеПодписей = Новый Массив; 
				Для Каждого УстановленнаяПодпись Из	УстановленныеПодписи Цикл
					ДанныеПодписей.Добавить(УстановленнаяПодпись.Подпись);
				КонецЦикла;
				
				ДанныеПодписи = ДанныеПодписей[0];
				ДанныеРегистрации = МашиночитаемыеДоверенностиФНССлужебныйВызовСервера.ЗарегистрироватьМЧДРР(СвойстваФайла.ДанныеФайла.Наименование, 
					СвойстваФайла.ДвоичныеДанные, ДанныеПодписи, ТокенДоступа, ДоверенностьДляПроверки.НомерДоверенности);
					
				ДоверенностьДляПроверки.ЗаписыватьВРегистр = Истина;
				Если ДанныеРегистрации.Ошибка <> Неопределено Тогда
					ДоверенностьДляПроверки.ДанныеОшибкиЗапросаСтатуса = ДанныеРегистрации.Ошибка;
					ДоверенностьДляПроверки.РезультатЗапросаСтатуса = ДанныеРегистрации.Ошибка.ЗаголовокОшибки;
					ДоверенностьДляПроверки.СтатусТранзакции = Перечисления.СтатусыТранзакцииСРеестромМЧД.Ошибка;
					ДоверенностьДляПроверки.ЗапросСтатусаТранзакции = Ложь;
					Если СпособУстранения(ДоверенностьДляПроверки.ДанныеОшибкиЗапросаСтатуса.СпособУстранения, "НеЗапрашиватьСтатусДоверенности") Тогда
						ДоверенностьДляПроверки.ЗапросСтатусаДоверенности = Ложь;
					КонецЕсли;
				Иначе
					ДоверенностьДляПроверки.ЗапросСтатусаТранзакции = Истина;
					ДоверенностьДляПроверки.ИдентификаторТранзакции = ДанныеРегистрации.ИдентификаторТранзакции;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ДоверенностьДляПроверки.ЗапросСтатусаТранзакции Тогда
			
				ДанныеСтатуса = МашиночитаемыеДоверенностиФНССлужебный.ПолучитьСтатусТранзакцииМЧДРР(ДоверенностьДляПроверки.ИдентификаторТранзакции, 
					ТокенДоступа, ДоверенностьДляПроверки.НомерДоверенности);
					
				ДоверенностьДляПроверки.ДатаЗапросаСтатуса = ТекущаяДатаСеанса();
				
				Если ДанныеСтатуса.Ошибка <> Неопределено Тогда
					ДоверенностьДляПроверки.ДанныеОшибкиЗапросаСтатуса = ДанныеСтатуса.Ошибка;
					ДоверенностьДляПроверки.РезультатЗапросаСтатуса = ДанныеСтатуса.Ошибка.ЗаголовокОшибки;
					ДоверенностьДляПроверки.СтатусТранзакции = Перечисления.СтатусыТранзакцииСРеестромМЧД.Ошибка;
					ДоверенностьДляПроверки.ЗаписыватьВРегистр = Истина;
					Продолжить;
				КонецЕсли;
				
				ДоверенностьДляПроверки.ЗаписыватьВРегистр = Истина;
				ДоверенностьДляПроверки.СтатусТранзакции = ДанныеСтатуса.СтатусТранзакции;
			КонецЕсли;
				
			Если ДоверенностьДляПроверки.ТипТранзакции = Перечисления.ТипыТранзакцийСРеестромМЧД.Регистрация Тогда
				Если ДоверенностьДляПроверки.СтатусТранзакции = Перечисления.СтатусыТранзакцииСРеестромМЧД.Успешно Тогда
					ДоверенностьДляПроверки.ТехническийСтатус = Перечисления.ТехническиеСтатусыМЧД.Зарегистрировано;
				ИначеЕсли ДоверенностьДляПроверки.СтатусТранзакции = Перечисления.СтатусыТранзакцииСРеестромМЧД.Ошибка Тогда
					Если Не СпособУстранения(ДоверенностьДляПроверки.ДанныеОшибкиЗапросаСтатуса.СпособУстранения, "ПовторнаяОтправка") Тогда
						ДоверенностьДляПроверки.ТехническийСтатус = Перечисления.ТехническиеСтатусыМЧД.ОшибкаРегистрации;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ДоверенностьДляПроверки.ТипТранзакции = Перечисления.ТипыТранзакцийСРеестромМЧД.Отмена Тогда
				Если ДоверенностьДляПроверки.СтатусТранзакции = Перечисления.СтатусыТранзакцииСРеестромМЧД.Успешно Тогда
					ДоверенностьДляПроверки.ТехническийСтатус = Перечисления.ТехническиеСтатусыМЧД.Отменена;
				ИначеЕсли ДоверенностьДляПроверки.СтатусТранзакции = Перечисления.СтатусыТранзакцииСРеестромМЧД.Ошибка Тогда
					ДоверенностьДляПроверки.ТехническийСтатус = Перечисления.ТехническиеСтатусыМЧД.Зарегистрировано;
				КонецЕсли;
			КонецЕсли;
			
			Если ДоверенностьДляПроверки.ДляНалоговыхОрганов
				И ДоверенностьДляПроверки.СтатусТранзакции <> Перечисления.СтатусыТранзакцииСРеестромМЧД.Ошибка
				И ДоверенностьДляПроверки.ТипТранзакции = Перечисления.ТипыТранзакцийСРеестромМЧД.Регистрация Тогда
				ДоверенностьДляПроверки.ЗапросСтатусаДоверенности = Истина;
			КонецЕсли;
				
			
			Если ДоверенностьДляПроверки.ЗапросСтатусаДоверенности И НЕ (ДоверенностьДляПроверки.ЗапросСтатусаТранзакции 
				И ДанныеСтатуса.СтатусТранзакции = Перечисления.СтатусыТранзакцииСРеестромМЧД.Ошибка)
				И ДоверенностьДляПроверки.ТехническийСтатус <> Перечисления.ТехническиеСтатусыМЧД.ОшибкаРегистрации Тогда
			
				ДанныеСтатусаДоверенности = МашиночитаемыеДоверенностиФНССлужебный.ПолучитьЧастичныеДанныеДоверенностиМЧДРР( 
					ДоверенностьДляПроверки.НомерДоверенности, ТокенДоступа);
					
				ДоверенностьДляПроверки.ДатаЗапросаСтатуса = ТекущаяДатаСеанса();
				
				Если ДанныеСтатусаДоверенности.Ошибка <> Неопределено Тогда
					Если Не СпособУстранения(ДанныеСтатусаДоверенности.Ошибка.СпособУстранения, "ПовторнаяОтправка") Тогда
						ДоверенностьДляПроверки.ДанныеОшибкиЗапросаСтатуса = ДанныеСтатусаДоверенности.Ошибка;
						ДоверенностьДляПроверки.РезультатЗапросаСтатуса = ДанныеСтатусаДоверенности.Ошибка.ЗаголовокОшибки;
						ДоверенностьДляПроверки.СтатусТранзакции = Перечисления.СтатусыТранзакцииСРеестромМЧД.Ошибка;
						ДоверенностьДляПроверки.ЗаписыватьВРегистр = Истина;
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				ДоверенностьДляПроверки.ДанныеОшибкиЗапросаСтатуса = Неопределено;
				ДоверенностьДляПроверки.СтатусТранзакции = Перечисления.СтатусыТранзакцииСРеестромМЧД.Успешно;
				
				ДоверенностьДляПроверки.ТехническийСтатус = МашиночитаемыеДоверенностиФНССлужебный.ПолучитьЗначениеСтатуса(ДанныеСтатусаДоверенности.СтатусДоверенности);
				ДоверенностьДляПроверки.ЗаписыватьВРегистр = ДоверенностьДляПроверки.ЗаписыватьВРегистр Или ЗначениеЗаполнено(ДоверенностьДляПроверки.ТехническийСтатус);
			КонецЕсли;
			
			РасчетныйСтатусДокумента = МашиночитаемыеДоверенностиФНССлужебныйКлиентСервер.РасчетныйСтатусДокумента(ДоверенностьДляПроверки.ТехническийСтатус);
			
			ДоверенностьДляПроверки.ЗаписыватьВДокумент = РасчетныйСтатусДокумента <> ДоверенностьДляПроверки.Статус;
			ДоверенностьДляПроверки.Статус = РасчетныйСтатусДокумента;
		КонецЦикла;

		ОтборКЗаписи = Новый Структура("ЗаписыватьВРегистр", Истина);
		ДоверенностиДляУстановкиСтатусов = ДоверенностиДляПроверкиСтатуса.Скопировать(ОтборКЗаписи);
		
		ЗаписатьРезультатОбновленияСтатуса(ДоверенностиДляУстановкиСтатусов);
		
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьРезультатОбновленияСтатуса(ДанныеДляЗаписи)
	
	ОтборКЗаписиВДокумент = Новый Структура("ЗаписыватьВДокумент", Истина);

	ДанныеДляЗаписиВДокумент = ДанныеДляЗаписи.Скопировать(ОтборКЗаписиВДокумент, "МашиночитаемаяДоверенность");
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.МашиночитаемыеДоверенностиСтатусы");
		ЭлементБлокировки.ИсточникДанных = ДанныеДляЗаписи;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("МашиночитаемаяДоверенность", "МашиночитаемаяДоверенность");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("Справочник.МашиночитаемыеДоверенности");
		ЭлементБлокировки.ИсточникДанных = ДанныеДляЗаписиВДокумент;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "МашиночитаемаяДоверенность");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		БлокировкаДанных.Заблокировать(); 
		
		ИзменившиесяСтатусы = Новый Соответствие;
		
		Для Каждого ДоверенностьДляПроверки Из ДанныеДляЗаписи Цикл
			МашиночитаемаяДоверенность = ДоверенностьДляПроверки.МашиночитаемаяДоверенность;
			СтатусМЧД = РегистрыСведений.МашиночитаемыеДоверенностиСтатусы.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(СтатусМЧД, ДоверенностьДляПроверки);
			СтатусМЧД.ДанныеОшибкиЗапросаСтатуса = Новый ХранилищеЗначения(ДоверенностьДляПроверки.ДанныеОшибкиЗапросаСтатуса);
			СтатусМЧД.Записать();
			Если ДоверенностьДляПроверки.ТехническийСтатусТекущий <> ДоверенностьДляПроверки.ТехническийСтатус Тогда
				Статусы = Новый Структура;
				Статусы.Вставить("СтатусДоИзменения", ДоверенностьДляПроверки.ТехническийСтатусТекущий);
				Статусы.Вставить("НовыйСтатус", ДоверенностьДляПроверки.ТехническийСтатус);
				ИзменившиесяСтатусы.Вставить(ДоверенностьДляПроверки.МашиночитаемаяДоверенность, Статусы);
			КонецЕсли;
			
			Если ДоверенностьДляПроверки.ЗаписыватьВДокумент = Истина Тогда
				МашиночитаемаяДоверенностьОбъект = МашиночитаемаяДоверенность.ПолучитьОбъект();
				МашиночитаемаяДоверенностьОбъект.Статус = ДоверенностьДляПроверки.Статус;
				МашиночитаемаяДоверенностьОбъект.Записать();
			КонецЕсли;
				
		КонецЦикла;
		
		ЗафиксироватьТранзакцию(); 
		
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(МашиночитаемыеДоверенностиФНССлужебный.ИмяСобытияЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	МашиночитаемыеДоверенностиФНСПереопределяемый.ПриИзмененииСтатусаДоверенности(ИзменившиесяСтатусы);
	
КонецПроцедуры

Функция СпособУстранения(СпособУстраненияСтрокой, Методика)
	Если ЗначениеЗаполнено(СпособУстраненияСтрокой) Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СпособУстраненияСтрокой);
		СпособУстранения = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Иначе
		Возврат Ложь;	
	КонецЕсли;
	
	МетодикиУстранения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СпособУстранения, "МетодикиУстранения", Неопределено);
	Если МетодикиУстранения.Найти(Методика) <> Неопределено Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли
